nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/drivers/fsl_power.h
/*
 * Copyright 2017,2020-2024 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_POWER_H_
#define _FSL_POWER_H_

#include "fsl_common.h"
#include "fsl_device_registers.h"
#include <stdint.h>

/*!
 * @addtogroup power
 * @{
 */
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief POWER driver version 2.0.0. */
#define FSL_POWER_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/**
 * @brief List of BOD levels
 */
typedef enum bod_level_s
{
    kBOD_LEVEL_1100mv = 0x102U,
    kBOD_LEVEL_1125mv = 0x002U,
    kBOD_LEVEL_1150mv = 0x103U,
    kBOD_LEVEL_1175mv = 0x003U,
    kBOD_LEVEL_1200mv = 0x104U,
    kBOD_LEVEL_1225mv = 0x004U,
    kBOD_LEVEL_1250mv = 0x105U,
    kBOD_LEVEL_1275mv = 0x005U,
    kBOD_LEVEL_1300mv = 0x106U,
    kBOD_LEVEL_1325mv = 0x006U,
    kBOD_LEVEL_1350mv = 0x107U,
    kBOD_LEVEL_1375mv = 0x007U,
    kBOD_LEVEL_1400mv = 0x108U,
    kBOD_LEVEL_1425mv = 0x008U,
    kBOD_LEVEL_1450mv = 0x109U,
    kBOD_LEVEL_1475mv = 0x009U,
    kBOD_LEVEL_1500mv = 0x10AU,
    kBOD_LEVEL_1525mv = 0x00AU,
    kBOD_LEVEL_1550mv = 0x02AU,
    kBOD_LEVEL_1575mv = 0x04AU,
    kBOD_LEVEL_1600mv = 0x10BU,
    kBOD_LEVEL_1625mv = 0x00BU,
    kBOD_LEVEL_1650mv = 0x02BU,
    kBOD_LEVEL_1675mv = 0x04BU,
    kBOD_LEVEL_1700mv = 0x10CU,
    kBOD_LEVEL_1725mv = 0x00CU,
    kBOD_LEVEL_1750mv = 0x02CU,
    kBOD_LEVEL_1775mv = 0x04CU,
    kBOD_LEVEL_1800mv = 0x10DU,
    kBOD_LEVEL_1825mv = 0x00DU,
    kBOD_LEVEL_1850mv = 0x02DU,
    kBOD_LEVEL_1875mv = 0x04DU,
    kBOD_LEVEL_1900mv = 0x10EU,
    kBOD_LEVEL_1925mv = 0x00EU,
    kBOD_LEVEL_1950mv = 0x02EU,
    kBOD_LEVEL_1975mv = 0x04EU,
    kBOD_LEVEL_2000mv = 0x10FU,
    kBOD_LEVEL_2025mv = 0x00FU,
    kBOD_LEVEL_2050mv = 0x02FU,
    kBOD_LEVEL_2075mv = 0x04FU,
    kBOD_LEVEL_2100mv = 0x110U,
    kBOD_LEVEL_2125mv = 0x010U,
    kBOD_LEVEL_2150mv = 0x030U,
    kBOD_LEVEL_2175mv = 0x050U,
    kBOD_LEVEL_2200mv = 0x111U,
    kBOD_LEVEL_2225mv = 0x011U,
    kBOD_LEVEL_2250mv = 0x031U,
    kBOD_LEVEL_2275mv = 0x051U,
    kBOD_LEVEL_2300mv = 0x112U,
    kBOD_LEVEL_2325mv = 0x012U,
    kBOD_LEVEL_2350mv = 0x032U,
    kBOD_LEVEL_2375mv = 0x052U,
    kBOD_LEVEL_2400mv = 0x113U,
    kBOD_LEVEL_2425mv = 0x013U,
    kBOD_LEVEL_2450mv = 0x033U,
    kBOD_LEVEL_2475mv = 0x053U,
    kBOD_LEVEL_2500mv = 0x114U,
    kBOD_LEVEL_2525mv = 0x014U,
    kBOD_LEVEL_2550mv = 0x034U,
    kBOD_LEVEL_2575mv = 0x054U,
    kBOD_LEVEL_2600mv = 0x115U,
    kBOD_LEVEL_2625mv = 0x015U,
    kBOD_LEVEL_2650mv = 0x035U,
    kBOD_LEVEL_2675mv = 0x055U,
    kBOD_LEVEL_2700mv = 0x116U,
    kBOD_LEVEL_2725mv = 0x016U,
    kBOD_LEVEL_2750mv = 0x036U,
    kBOD_LEVEL_2775mv = 0x056U,
    kBOD_LEVEL_2800mv = 0x117U,
    kBOD_LEVEL_2825mv = 0x017U,
    kBOD_LEVEL_2850mv = 0x037U,
    kBOD_LEVEL_2875mv = 0x057U,
    kBOD_LEVEL_2900mv = 0x118U,
    kBOD_LEVEL_2925mv = 0x018U,
    kBOD_LEVEL_2950mv = 0x038U,
    kBOD_LEVEL_2975mv = 0x058U,
    kBOD_LEVEL_3000mv = 0x119U,
    kBOD_LEVEL_3025mv = 0x019U,
    kBOD_LEVEL_3050mv = 0x039U,
    kBOD_LEVEL_3075mv = 0x059U,
    kBOD_LEVEL_3100mv = 0x11AU,
} bod_level_t;

/**
 * @brief List of reset actions when BOD occurs
 */
typedef enum bod_action_s
{
    kBOD_NO_ACTION = 0U,
    kBOD_RESET     = 1U,
    kBOD_INTERRUPT = 2U
} bod_action_t;

/**
 * @brief List of supply modes
 */
typedef enum dcdc_mode_s
{
    kDCDC_MODE_HV_SM    = 1U, /*!< HV supplied */
    kDCDC_MODE_XR_SM_SS = 3U, /*!< HV and LV supplied and equal (Single Supply) */
    kDCDC_MODE_XR_SM_DS = 4U, /*!< HV and LV supplied and not equal (Dual Supply) */
} dcdc_mode_t;

/**
 * @brief List of reset causes
 */
typedef enum reset_cause_s
{
    kRESET_CAUSE_POR    = PMC_RESETCAUSE_POR_MASK,               /*!< Power On Reset */
    kRESET_CAUSE_PAD    = PMC_RESETCAUSE_PADRESET_MASK,          /*!< Pin Reset */
    kRESET_CAUSE_BOD    = PMC_RESETCAUSE_BODRESET_MASK,          /*!< Brown Out Detector */
    kRESET_CAUSE_SYS    = PMC_RESETCAUSE_SYSTEMRESET_MASK,       /*!< System Reset requested by the ARM CPU */
    kRESET_CAUSE_WDT    = PMC_RESETCAUSE_WDTRESET_MASK,          /*!< Watchdog Timer */
    kRESET_CAUSE_SWR    = PMC_RESETCAUSE_SWRRESET_MASK,          /*!< Software reset */
    kRESET_CAUSE_DPD_IO = PMC_RESETCAUSE_DPDRESET_WAKEUPIO_MASK, /*!< Wake-up I/O reset event during DEEP POWER DOWN */
    kRESET_CAUSE_RTC    = PMC_RESETCAUSE_DPDRESET_RTC_MASK,      /*!< Real Time Clock*/
    kRESET_CAUSE_OST    = PMC_RESETCAUSE_DPDRESET_OSTIMER_MASK,  /*!< OS Event Timer */
    kRESET_CAUSE_CDOG   = PMC_RESETCAUSE_CDOGRESET_MASK,         /*!< code Watchdog */
    kRESET_CAUSE_BLE    = PMC_RESETCAUSE_BLEWUP_MASK,            /*!< BLE Timer wakeup */
} reset_cause_t;

/**
 * @brief List of DC/DC outputs when configured in buck mode
 */
typedef enum dcdc_buck_output_level_s
{
    kDCDC_BUCK_OUTPUT_1100mv = 0U,
    kDCDC_BUCK_OUTPUT_1200mv = 1U,
    kDCDC_BUCK_OUTPUT_1300mv = 2U,
    kDCDC_BUCK_OUTPUT_1400mv = 3U,
    kDCDC_BUCK_OUTPUT_1500mv = 4U,
    kDCDC_BUCK_OUTPUT_1600mv = 5U,
    kDCDC_BUCK_OUTPUT_1700mv = 6U,
    kDCDC_BUCK_OUTPUT_1800mv = 7U
} dcdc_buck_output_level_t;

typedef enum
{
    kBIAS_0_66V_LOW_POWER_MODE     = 0u, /**< This is intended to be used for retention mode of memory or digital */
    kBIAS_0_63V_HIGH_ACCURACY_MODE = 1u, /**< During active mode, the bias must be set in high accuracy mode */
    kBIAS_DISABLED                 = 2u, /**< Bias disabled */
    kBIAS_DISABLED2                = 3u  /**< Bias disabled */
} bias_pden_bias_t;

/**
 * @brief List of analog peripherals bits that can be powered on (see POWER_PeripheralPowerOn()) or off (see
 * POWER_PeripheralPowerOff()) in active mode
 */
typedef enum power_config_bit_s
{
    kPOWERCFG_DCDC    = (1UL << PMC_PDRUNCFG0_PDEN_DCDC_SHIFT),
    kPOWERCFG_BIAS    = (3UL << PMC_PDRUNCFG0_PDEN_BIAS_SHIFT), /* includes 0.66V/0.63V */
    kPOWERCFG_BOD1    = (1UL << PMC_PDRUNCFG0_PDEN_BOD1_SHIFT),
    kPOWERCFG_BOD2    = (1UL << PMC_PDRUNCFG0_PDEN_BOD2_SHIFT),
    kPOWERCFG_FRO192M = (1UL << PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT),
    kPOWERCFG_FRO1M   = (1UL << PMC_PDRUNCFG0_PDEN_FRO1M_SHIFT),
    kPOWERCFG_FRO32K  = (1UL << PMC_PDRUNCFG0_PDEN_FRO32K_SHIFT),
    kPOWERCFG_XTAL32K = (1UL << PMC_PDRUNCFG0_PDEN_XTAL32K_SHIFT),
    kPOWERCFG_BLE     = (1UL << PMC_PDRUNCFG0_PDEN_BLE_SHIFT),
    kPOWERCFG_RNG     = (1UL << PMC_PDRUNCFG0_PDEN_RNG_SHIFT)
} power_config_bit_t;

/**
 * @brief List of analog peripherals bits that can be excluded from being powered off when entering a low power mode.
 * The comment next to each item of the list specifies in which low power modes the peripheral can be excluded.
 * Note: (*) is always excluded for this power mode
 *
 * On DCDC_BYPASS:
 * VDD_IO needs to be supplied in the low power modes in order to enable the IO functionality (wakeup pin,
 * flexcom wakeup, reset, ...) The application needs to guarantee this supply by connecting the VDD_IO to the battery
 * directly or an external PMIC device. In case the VDD_IO is supplied by the output of the MCXW23x DC/DC converter,
 * the DC/DC convertor can't be switched off but must be put in bypass mode. Enabling the bypass switch will put the
 * DC/DC input level to the output minus the drop over the switch (typical xx mV). Enabling the bypass switch increased
 * also the leakage in power-off mode (see datasheet for typical value).
 *
 */
typedef enum low_power_config_bit_s
{
    kLOWPOWERCFG_DCDC = (1UL << PMC_PDSLEEPCFG0_PDEN_DCDC_SHIFT), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_BOD1 = (1UL << PMC_PDSLEEPCFG0_PDEN_BOD1_SHIFT), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_BOD2 = (1UL << PMC_PDSLEEPCFG0_PDEN_BOD2_SHIFT), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_FRO192M = (1UL << PMC_PDSLEEPCFG0_PDEN_FRO192M_SHIFT), /**< [DEEP SLEEP] */
    kLOWPOWERCFG_FRO32K =
        (1UL << PMC_PDSLEEPCFG0_PDEN_FRO32K_SHIFT), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_XTAL32K =
        (1UL << PMC_PDSLEEPCFG0_PDEN_XTAL32K_SHIFT),                /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_FRO1M = (1UL << PMC_PDSLEEPCFG0_PDEN_FRO1M_SHIFT), /**< [DEEP SLEEP,    POWER DOWN]                  */
    kLOWPOWERCFG_TRNG  = (1UL << PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT),   /**< [DEEP SLEEP,    POWER DOWN]               */
    kLOWPOWERCFG_DCDC_BYPASS =
        (1UL << (PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT + 1)), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_BLE_WUP =
        (1UL << (PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT + 2)), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_HFDSM = (1UL << (PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT + 3)) /**< [DEEP SLEEP] */
} low_power_config_bit_t;

/**
 * @brief List CPU retention configurations
 */
typedef enum cpu_retention_config_s
{
    kCPU_RETENTION_DISABLE = 0U,
    kCPU_RETENTION_ENABLE  = 1U
} cpu_retention_config_t;

